var NameList = [
    'v字仇杀队', 
    '阿凡达', 
    '蝙蝠侠', 
    '电锯惊魂', 
    '蜘蛛侠', 
    '孙悟空', 
    '阿飞',

    '曹操', 
    '曹洪', 
    '蒋干', 
    '关羽', 
    '姜尚', 
    '孟良', 
    '夏侯惇', 
    '许褚', 
    '宇文成都', 
    '周德威',
    '程咬金', 
    '单雄信', 
    '后羿', 
    '黄盖', 
    '黄胖', 
    '姜维', 
    '焦赞', 
    '荆轲', 
    '雷震子', 
    '廉颇', 
    '吕蒙', 
    '马谡', 
    '司马懿', 
    '孙权', 
    '太史慈', 
    '尉迟恭', 
    '徐晃', 
    '杨延德', 
    '杨延嗣', 
    '张飞', 
    '赵高', 
    '赵匡胤', 
    '钟离春', 
    '专诸'
];
var introductionList = ['《V字仇杀队》讲述了一个关于战争、毁灭、无政府主义、法西斯的故事。故事假定德国赢得了第二次世界大战，英国沦为法西斯国家，人民生活在没有政治和人身自由的境况下。一个叫“V”的保安员在街上悄悄奔走，试图唤醒人们的反抗意识，把英国从法西斯魔掌下解救出来。', // 'v字仇杀队',  
'Navi族人一直以来都与潘多拉星球的其他物种和谐相处，过着一种简朴天然的生活，杰克在和这个Navi女孩的相处过程中逐渐转变了对人类来这里采矿的看法，他意识到已经找到值得为之战斗的东西了。不过杰克•萨利如果要加入Navi族人对抗人类入侵者的战争，要付出很大的代价：他不能永远呆在“化身”中，当“化身”——克隆Navi人睡觉时，他就会回到自己半身不遂的人类身体中，只有通过专门的连接设备才能重新回到“化身”中。一旦与自己的同胞为敌，他就失去了与“化身”结合的可能，只能困在残疾的身体里，并失去那个他越来越喜欢的Navi女孩。', // '阿凡达',        
'蝙蝠侠（Batman）1939年5月于《侦探漫画》（Detective Comics）第27期首次登场，是漫画史上第一位没有超能力的超级英雄。他本名布鲁斯•韦恩（Bruce Wayne），是高谭市首富韦恩家族的独子。布鲁斯在儿时亲眼目睹父母被犯罪分子杀害，他发誓要扫除罪恶，不让别的孩子也遭受这样的命运。为此他遍访名师，掌握了各种侦探知识和战斗技巧，并依靠韦恩集团制造了大量高科技装备，开始了他的圣战。白天，他是别人眼中的无脑富二代、花花公子；夜晚，他是令罪犯闻风丧胆的黑暗骑士——蝙蝠侠。', // '蝙蝠侠',    
'电锯惊魂中的一个反派角色Jigsaw的汉译。竖锯是一个手无缚鸡之力，并且身患绝症的中老年人，因为自己不顺利的婚姻生活和绝症，这个老爷子在自杀失败后决定自封为上帝，去挑选一些整天碌碌无为的人来作为试炼的目标，试炼的过程是各种匪夷所思的陷阱和残酷的谜题，招招致命。如果通过试炼，就能继续活下去。本身没有战斗力的竖锯，却拥有和汉尼拔一样强大的心理素质，总是将局势牢牢地掌握在自己手中，将看起来比他强壮很多的测试目标玩弄于鼓掌之间，在陷阱设置和对局势的把控方面甚至高出汉尼拔一筹，所以尽管他没有汉尼拔的身体素质，但在综合杀伤力方面以及玩弄血浆的手段上要高于汉尼拔。', // '电锯惊魂',
'蜘蛛侠（Spider-Man）首次登场是在1962年8月出版的《惊奇幻想》第15期，因为广受欢迎，几个月开始后，他开始拥有以自己为主角的单行本漫画。蜘蛛侠的真名是彼得•本杰明•帕克（Peter Benjamin Parker），一名普通的高中生，意外的被一只受过放射性感染的蜘蛛咬伤后，获得蜘蛛一般的特殊能力。', // '蜘蛛侠',
'孙悟空是中国明代小说家吴承恩的著作《西游记》中的角色之一。孙悟空，诨名行者，是唐僧的大徒弟，猪八戒、沙悟净的大师兄。会七十二变、腾云驾雾。有一双火眼金睛，能看穿妖魔鬼怪的伪装；一个筋斗能翻十万八千里；使用兵器如意金箍棒，能大能小，随心变化。他占花果山为王，自称齐天大圣，与如来佛祖斗法，被压在五行山下五百多年。后经观世音菩萨点化，保护唐僧西天取经，历经九九八十一难，取回真经终成正果，被封为斗战胜佛。代表了古代中国人善良、正义、不阿的情怀和追求。', // '孙悟空',
'《火影忍者》中反派boss级角色，晓组织的真正领袖。少年时与旗木卡卡西、野原琳同为波风水门弟子。神无毗桥之战重伤濒死，将左眼赠与卡卡西，被宇智波斑用柱间细胞再造一半肢体救活。因亲眼目睹琳的死，性情大变转而走向异途。后假扮宇智波斑，从玖辛奈体内抽出九喇嘛袭击木叶，导致水门、玖辛奈夫妇之死。同宇智波鼬一起剿灭宇智波一族，暗中操控四代水影矢仓多年。利用晓组织收集尾兽，以完成月之眼计划。', // '阿飞',
'曹操（155年－220年正月庚子[1]），字孟德，一名吉利，小字阿瞒，沛国谯（今安徽亳州）人，汉族。东汉末年杰出的政治家、军事家、文学家、书法家[2-3]。三国中曹魏政权的缔造者，以汉天子的名义征讨四方，对内消灭二袁、吕布、刘表、韩遂等割据势力，对外降服南匈奴、乌桓、鲜卑等，统一了中国北方，并实行一系列政策恢复经济生产和社会秩序，奠定了曹魏立国的基础。曹操在世时，担任东汉丞相，后为魏王，去世后谥号为武王。其子曹丕称帝后，追尊为武皇帝，庙号太祖。', // '曹操',
'曹洪（？－232年），字子廉，沛国谯（今安徽亳县）人，曹操从弟。曹操追袭董卓荥阳为徐荣所败失马，曹洪舍命献马并救护曹操，使曹操免于厄难。后多随军征伐，平兖州、征刘表、讨祝臂。官渡之战时曹操令其驻守本阵。后据张飞等于下辩，破斩吴兰、任夔，退张飞与马超。曹丕即位时封曹洪为骠骑将军，后因私事寻衅欲处死曹洪，因卞太后求情免死，贬为庶民，曹叡即位，拜曹洪为后将军，更封乐城侯，后复拜为骠骑将军。曹洪逝世，追谥曰恭侯。', // '曹洪',
'卢国公程知节（589—665），字义贞，原名咬金，后更名知节。汉族，济州东阿斑鸠店人（今属山东省东平县）。唐朝开国名将，封卢国公，位列凌烟阁二十四功臣。唐太宗贞观年间，官拜左金吾大将军。历代小说演义等多有描写（小说中惯称“程咬金”），主要描写程咬金为了生活，被迫劫道，后与十八条好汉聚义瓦岗寨，反抗暴隋的故事。小说中，程咬金个性鲜明，以“三板斧”（实际使用武器为槊）的形象在民间广为流传。', // '蒋干',
'关羽（约162－220年[1]），字云长（原为长生），河东解良（今山西运城）人，汉末三国时期名将。刘备起兵时，关羽跟随刘备，忠心不二，深受刘备信任。刘备、诸葛亮等入蜀地，关羽镇守荆州，刘备夺取汉中后，关羽乘势北伐曹操，曾围襄阳、擒于禁、斩庞德、威震华夏，曹操几欲迁都避其锋，但东吴偷袭荆州，关羽兵败被害。关羽去世后，逐渐被神化，被民间尊为“关公”；历代朝廷多有褒封，清代奉为“忠义神武灵佑仁勇威显关圣大帝”，崇为“武圣”，与“文圣” 孔子齐名。《三国演义》尊其为蜀国“五虎上将”之首，毛宗岗称其为“《演义》三绝”之“义绝”。', // '关羽',
'姜子牙， 姜姓，吕氏，名尚，一名望，字子牙，或单呼牙，也称吕尚。生于公元前1156，死于公元前1017年，寿至139岁，先后辅佐了六位周王，因是齐国始祖而称“太公望”，俗称姜太公。西周初年，被周文王封为“太师”（武官名），被尊为“师尚父”，辅佐文王，与谋“翦商”。后辅佐周武王灭商。因功封于齐，成为周代齐国的始祖。他是中国历史上杰出的政治家、军事家和谋略家。', // '姜尚',
'孟良和焦赞是杨家将中两员都以勇猛著称的大将，常常一起出场，被称为焦不离孟，孟不离焦，孟良焦赞在历史上都有一点踪迹，但孟良没有明确记载，只知道他是杨延昭部将，墓地在河北永清。', // '孟良',
'夏侯惇（？－220年），字元让，沛国谯（今安徽亳州）人，曹魏开国元勋，汉朝开国功臣之一夏侯婴的后代。少年时以勇气闻名于乡里。曹操起兵，夏侯惇是其最早的将领之一。多次为曹操镇守后方，曾率军民阻断太寿河水，筑陂塘灌溉农田，使百姓受益，功勋卓著。历任折冲校尉、济阴太守、建武将军，官至大将军，封高安乡侯，死后谥为忠侯。夏侯惇一生虽多在军旅，但仍不忘治学。他常亲自迎师，虚心求教。他为人俭朴，所得赏赐全部分给将士。一生不置产业，至死家无余财。', // '夏侯惇',
'许褚 字仲康，谯国谯人。长八尺馀，腰大十围，容貌雄毅，勇力绝人，与葛陂贼交战时在箭矢耗尽的情况下掷石攻敌，后在粮食短缺的情况下诈作与贼和解并以耕牛交换粮食一但在牛突然狂奔的情况下拿着牛反方向行百余步，由此在淮汝一带的人提起许褚之名皆畏惮。随曹操屯官渡时发现欲谋害曹操者，将刺客全部杀掉。关中之战时在身披重甲的情况下左手掩面，右手控船浆令曹操安然成功渡河，上岸才发现早已身中数箭，在与马超、韩遂会面时只让许褚相随，期间马超欲袭曹操，但听闻许褚之名兼怀疑从骑就是许褚，便问曹操虎侯安在，曹操指着许褚，许褚怒视马超以令他放弃。当曹操去世时许褚哭至吐血，曹丕其迁作武卫将军，负责宫中安全。曹叡继位时封其为牟乡侯，谥曰壮侯。', // '许褚',
'宇文成都，《说唐》、《兴唐传》等隋唐小说中所描绘人物，史实中并无此人。小说描绘，宇文成都为大隋丞相宇文化及之子，外号天宝大将，号称大隋第二条好汉，武力仅次于李元霸，“身长一丈，腰大数围，金面长须，虎目浓眉，使一柄凤翅镏金镋，重三百二十斤”，传说为九天应元雷神普化天尊转世。在抑制反王势力方面有突出贡献。后十八路反王讨宇文化及，宇文成都被李元霸所杀。', // '宇文成都',
'中国五代名将。字镇远，小字阳五，朔州马邑（今山西朔县）人。勇而多谋，久在云中（今山西大同），谙知边事。唐乾宁中，随晋王李克用攻王行瑜，以功由铁林军使升检校左仆射、衙内指挥使。', // '周德威',
'卢国公程知节（589—665），字义贞，原名咬金，后更名知节。汉族，济州东阿斑鸠店人（今属山东省东平县）。唐朝开国名将，封卢国公，位列凌烟阁二十四功臣。唐太宗贞观年间，官拜左金吾大将军。历代小说演义等多有描写（小说中惯称“程咬金”），主要描写程咬金为了生活，被迫劫道，后与十八条好汉聚义瓦岗寨，反抗暴隋的故事。小说中，程咬金个性鲜明，以“三板斧”（实际使用武器为槊）的形象在民间广为流传。', // '程咬金',
'单雄信（？—621年） 曹州济阴（曹县）人。少勇健。隋末入瓦岗起义军。617年，任左武侯大将军。618年，率军投降王世充。620年，李世民率军包围东都。 单雄信与尉迟敬德交战，被刺坠马。次年，李世民克东都，王世充降唐，单雄信被杀。', // '单雄信',
'后羿本称“司羿”，是“群司”（司空、司徒等）之一。“司”本义指知识和技能在家族中世代传承。“羿”是“射师”之义。“司羿”是“世袭的射师”。在帝喾时代，当时一位射师被任命为羽林军教头。此后这一显赫职务就在该家族内部世代传承。到了夏初，因太康不理朝政，作为羽林军教头的司羿发动宫廷政变（此即“射日”），摄取夏政，史称“后羿”（“后”由“司”字改造而来，意思是“世袭的帝王”）。后被家臣寒浞所杀。寒浞要继承后羿的权位，按当时习俗，应该烝娶羿妻嫦娥。嫦娥奔月，入住“广寒宫”，这就是“寒舍”，即“寒浞之舍”。', // '后羿',
'黄盖，字公覆，零陵泉陵（今湖南省永州市零陵区）人。东汉末年名将，历仕孙坚、孙策、孙权三任君主。早年为郡吏，后追随孙坚走南闯北。孙权即位，诸山越不宾，黄盖活跃在镇抚山越的一线，前后九县，所在悉平，迁丹杨都尉。黄盖为人严肃，善于训练士卒，每每征讨，他的部队皆勇猛善战。公元208年赤壁之战时，黄盖前往曹营诈降，并趁机以火攻大破曹操的军队，是赤壁之战主要功臣之一，以功拜武锋中郎将，他也因为此事迹而被后人广为传颂，小说《三国演义》在刻画黄盖这一人物时描写了“苦肉计”的故事。不久武陵蛮夷反，攻打城邑，黄盖以五百人，放其半入，拦腰截击，大破诸贼。春去夏来，寇乱尽平。后又平讨长沙益阳县山贼，加偏将军。官至偏将军、武陵太守。有一子黄柄。', // '黄盖',
'京剧《刺巴杰》（又名：《酸枣岭》《巴骆和》）黄胖是京剧《刺巴杰》剧中人物，即和尚黄胖。行当（角色）：净行。僧脸谱：“僧脸”又名“和尚脸”，脑门勾一个舍利珠圆光或九个点，表示佛门受黄色：勇猛、骠悍；凶狠、暴躁。', // '黄胖',
'姜维（202－264年），字伯约，天水冀县（今甘肃甘谷东南）人。三国时期蜀汉著名将领、军事统帅。原为曹魏天水郡的中郎将，后降蜀汉，官至凉州刺史、大将军。姜维在诸葛亮去世后继承诸葛亮的遗志，继续率领蜀汉军队北伐曹魏，与曹魏名将邓艾、陈泰、郭淮等多次交手。后因蜀中大臣也多反对姜维北伐，而宦官黄皓弄权，姜维杀之不成，只得在沓中屯田避祸，后司马昭五道伐蜀，姜维拒守剑阁，阻挡住钟会大军，却被邓艾从阴平偷袭成都，刘禅投降。后姜维希望凭自己的力量复兴蜀汉，假意投降魏将钟会，打算利用钟会反叛曹魏以实现恢复汉室的愿望，但最终钟会反叛失败，姜维自刎而死', // '姜维',
'焦赞，一代猛将，坚州砂河（今山西省繁峙县砂河镇）人。北宋后期富弼部下，也是抵抗辽军的北军将领，焦赞墓在今天河北雄县。在杨家将演义中，焦赞是追随杨延昭的猛将，同孟良并称，抗辽有战功，久镇瓦桥关（河北雄县一带），也就是镇雄州（雄县），名望颇高。他和孟良等是杨家将的左右臂，是一位名闻河北的抗辽勇将。', // '焦赞',
'荆（jīng）轲(ke)（？～公元前227年）：姜姓，庆氏（古时“荆”音似“庆”）。战国末期卫国人，中国战国时期著名刺客，也称庆卿、荆卿、庆轲，是春秋时期齐国大夫庆封的后代。受燕太子丹之托入刺秦王，因为被夏无且（jū）的药囊击中，被秦王拔剑所杀，秦王杀他时连刺八下才停手，行刺失败被杀。', // '荆轲',
'《封神演义》的角色，面如青靛，发似朱砂，眼睛暴湛，牙齿横生，出于脣外；身躯长有二丈，使用一条黄金棍，是文王姬昌第一百子，也是阐教门人，云中子的弟子，为武王伐纣立下赫赫战功。', // '雷震子',
'廉颇（约公元前327年-公元前243年），嬴姓，廉氏，名颇，山西太原人。战国末期赵国的名将，与白起、王翦、李牧并称“战国四大名将”。曾率兵讨伐齐国，取得大胜，夺取了晋阳，赵王封他为上卿。廉颇因为勇猛果敢而闻名于诸侯各国。长平之战前期，他以固守的方式成功抵御了秦国军队。长平之战后，又击退了燕国的入侵，斩杀燕国的栗腹，并令对方割五城求和。晚年时，因不得志，他先后投奔魏国大梁和楚国，去世后葬于寿春', // '廉颇',
'吕蒙（178－219，一说180－220），字子明，东汉末年名将，汝南富陂人[1]。少年时依附姊夫邓当，随孙策为将。以胆气称，累封别部司马。孙权统事后，渐受重用，从破黄祖作先登，封横野中郎将。从围曹仁于南郡，并于濡须数御曹军，屡献奇计，累功拜庐江太守。后进占荆南三郡，计擒郝普，于合淝战奋勇抵抗魏军追袭，以功除左护军、虎威将军。又后代鲁肃守陆口，设计袭取荆州，击败蜀汉名将关羽，使东吴国土面积大增，拜南郡太守，封孱陵侯，受勋殊隆。然而“蒙疾发”（后世人或猜测建安二十四年发生瘟疫，因史载吕蒙、孙皎、蒋钦死于同年，或猜测是吕蒙年轻时在战场上吃苦受累导致积劳成疾），不治而薨，享年四十二岁。吕蒙发愤勤学的事迹，成为了中国古代将勤补拙、笃志力学的代表，与其有关的成语有“士别三日”，“刮目相待”、“吴下阿蒙”等。', // '吕蒙',
'马谡（190－228），字幼常，襄阳宜城（今湖北宜城南）人，三国时期蜀汉大臣，侍中马良之弟。初以荆州从事跟随刘备取蜀入川，曾任绵竹、成都令、越嶲太守。蜀汉丞相诸葛亮用为参军。马谡“才器过人”，好论军计。诸葛亮向来对他倍加器重，每引见谈论，自昼达夜；但马谡却于诸葛亮北伐时因作战失误而失守街亭，因而被诸葛亮所斩。', // '马谡',
'司马懿（179－251年），字仲达，汉族，河内郡温县孝敬里人。三国时期魏国杰出的政治家、军事家，西晋王朝的奠基人。曾任职过曹魏的大都督，大将军，太尉，太傅。是辅佐了魏国三代的托孤辅政之重臣，后期成为掌控魏国朝政的权臣。善谋奇策，多次征伐有功，其中最显著的功绩是两次率大军成功对抗诸葛亮北伐和远征平定辽东。对屯田、水利等农耕经济发展有重要贡献。73岁去世，辞郡公和殊礼，葬于首阳山。谥号“宣文”；次子司马昭封晋王后，追封司马懿为宣王；司马炎称帝后，追尊司马懿为宣皇帝。', // '司马懿',
'吴太祖孙权（182年12月22日－252年5月21日），字仲谋，吴郡富春（今浙江富阳）人，三国时代东吴的建立者。孙权的父亲孙坚和兄长孙策，在东汉末年群雄割据中打下了江东基业。十九岁时兄长孙策遭刺杀身亡后，孙权继而掌事，成为一方诸侯。208年，孙权与刘备联合于赤壁打败曹操军队，建立了孙刘联盟。219年，孙权派吕蒙偷袭刘备的荆州成功，使吴国的领土面积大大增加。222年被魏文帝曹丕封为吴王，建立吴国；229年称帝。是三国时代统治者中最长寿的。孙权称帝后，设置农官，实行屯田，平定山越，设置郡县，促进了江南经济的发展。在此基础上，他又多次派人出海。230年，他派卫温到达夷州。晚年“多嫌忌，果于杀戮”，而且在继承人问题上反复无常，引致群下党争。252年病逝，享年70岁，庙号太祖，谥号大皇帝。', // '孙权',
'太史慈（166－206年），字子义，东莱黄县（今山东龙口东黄城集）人。东汉末年武将，官至建昌都尉。弓马熟练，箭法精良。原为刘繇部下，后被孙策收降，自此太史慈为孙氏大将，助其扫荡江东。孙权统事后，因太史慈能制刘磐，便将管理南方的要务委托给他。建安十一年（206年）太史慈逝世，死前说道：“丈夫生世，当带七尺之剑，以升天子之阶。今所志未从，奈何而死乎！”（《吴书》，《三国演义》为“大丈夫生于乱世，当带三尺剑立不世之功；今所志未遂，奈何死乎！”）言讫而亡，年四十一岁。', // '太史慈',
'尉迟恭（585—658），字敬德，鲜卑族，朔州鄯阳（今山西朔州朔城区）人。中国唐朝名将，封鄂国公，是凌烟阁二十四功臣之一，赠司徒兼并州都督，谥忠武，赐陪葬昭陵。尉迟恭纯朴忠厚，勇武善战，一身戎马倥偬，征战南北，驰骋疆场，屡立战功。玄武门之变助李世民夺取帝位。后尉迟恭被尊为民间驱鬼避邪，祈福求安的中华门神。传说其面如黑炭，在中国传统文化中，尉迟恭（胡敬德）与秦叔宝（秦琼）是“门神”的原型。', // '尉迟恭',
'徐晃（？－227年），字公明，河东杨（今山西洪洞东南）人。三国时期曹魏名将。本为杨奉帐下骑都尉，杨奉被曹操击败后转投曹操，在曹操手下多立功勋，参与官渡、赤壁、关中征伐、汉中征伐等几次重大战役。樊城之战中徐晃作为曹仁的援军击败关羽，因于此役中治军严整而被曹操称赞“有周亚夫之风”。曹丕称帝后，徐晃被加为右将军，于公元227年病逝，谥曰壮侯。', // '徐晃',
'杨五郎，金刀老令公杨业的第五子，名杨春，字延德。北宋殿前大将，为杨家军副帅。 年约二十二，武功在七子之上，却不喜欢战争，天生慈悲心肠，一心向佛，浸淫于学武中，大有宗师风范。', // '杨延德',
'金刀老令公杨业的第七子，名杨希，字延嗣，人称“杨七郎”。在《金沙滩战役》之前，杨门七子中，大郎延平（封忠孝侯、保驾大将军）、二郎延定（封义勇侯）、三郎延光（封忠武将）、四郎延朗、五郎延德（杨家军副帅）五兄弟因战功显著，都被皇帝封为殿前大将军；而六郎延昭、七郎延嗣因年纪较小，又无战功，杨业便把他们安排在杨家军中做帐前校尉。', // '杨延嗣',
'张飞（？－221），字益德（《三国演义》中字翼德），东汉末年幽州涿郡（今河北省保定市涿州市）人氏，三国时期蜀汉名将。刘备长坂坡败退，张飞仅率二十骑断后，据水断桥，曹军没人敢逼近；与诸葛亮、赵云扫荡西川时，于江州义释严颜；汉中之战时又于宕渠击败张郃，对蜀汉贡献极大，官至车骑将军、领司隶校尉，封西乡侯，后被范强、张达刺杀。后主时代追谥为“桓侯”。在中国传统文化中，张飞以其勇猛、鲁莽、嫉恶如仇而著称，虽然此形象主要来源于小说和戏剧等民间艺术，但已深入人心。', // '张飞',
'赵高（？－前207），中国秦朝二世皇帝时丞相，著名宦官（一说并非宦官）。沙丘之变和望夷宫之变的主谋，指鹿为马事件的策划者。秦始皇死后与李斯合谋篡改诏书，立始皇幼子胡亥为帝，并逼死始皇长子扶苏。秦二世即位后设计陷害李斯，并成为丞相。后派人杀死秦二世，不久后被秦王子婴所杀。', // '赵高',
'赵匡胤（927年3月21日－976年11月14日），北宋王朝的开国皇帝，庙号宋太祖。出生于洛阳夹马营，祖籍河北涿州。年轻时曾经在少林寺学习武术。948年，投后汉枢密使郭威幕下，屡立战功。951年，郭威称帝，建立后周，赵匡胤任禁军军官，周世宗时官至殿前都点检。960年，发动陈桥兵变，黄袍加身，代周称帝，建立宋朝，定都开封，在位16年。在位期间，加强中央集权，提倡文人政治，开创了中国的文治盛世，死后葬于郑州巩义宋陵之永昌陵。', // '赵匡胤',
'钟无艳，又名钟离春、钟无盐，齐宣王之妻，中国古代四大丑女兼才女。传为战国时齐国无盐邑之女。貌极丑，四十岁不得出嫁，自请见齐宣王，陈述齐国危难四点，为宣王采纳，立为王后。于是拆渐台、罢女乐、退谄谀，进直言，选兵马，实府库，齐国大安。', // '钟离春',
'专诸，生卒：（?-前515），亦称：鱄设诸，籍贯：春秋时吴国堂邑（今南京市六合区西北），吴公子光（即吴王阖闾）欲杀王僚自立，伍子胥把他推荐给公子光。公元前515年，公子光乘吴内部空虚，与专诸密谋，以宴请吴王僚为名，藏匕首于鱼腹之中进献，当场刺杀吴王僚，专诸也被吴王僚的侍卫杀死。公子光自立为王，是为吴王阖闾，乃以专诸之子为卿。专诸是中国古代“四大刺客”（一说五大刺客）之一。“士之怒也。夫专诸之刺王僚也，彗星袭月；聂政之刺韩傀也，白虹贯日；要离之刺庆忌也，苍鹰击于殿上。”鱼肠剑出于“专诸刺王僚”。' // '专诸'
];
var facebookInfo = [
{   //V字仇杀队
    eye_left: {x: 90,y: 195},
    eye_right: {x: 270,y: 195},
    nose: {x: 181,y: 320},
    mouth: {y: 350},
    length: 363,
    height: 489
},
{   //阿凡达
    eye_left: {x: 30,y: 100},
    eye_right: {x: 140,y: 100},
    nose: {x: 92,y: 150},
    mouth: {y: 190},
    length: 184,
    height: 236
},
{   //蝙蝠侠
    eye_left: {x: 90,y: 172},
    eye_right: {x: 210,y: 172},
    nose: {x: 150,y: 270},
    mouth: {y: 300},
    length: 300,
    height: 387
},
{   //电锯惊魂
    eye_left: {x: 40,y: 70},
    eye_right: {x: 120,y: 70},
    nose: {x: 81,y: 140},
    mouth: {y: 152},
    length: 163,
    height: 228
},
{   //蜘蛛侠
    eye_left: {x: 30,y: 55},
    eye_right: {x: 70,y: 55},
    nose: {x: 50,y: 80},
    mouth: {y: 95},
    length: 100,
    height: 130
},
{   //孙悟空
    eye_left: {x: 25,y: 65},
    eye_right: {x: 75,y: 65},
    nose: {x: 50,y: 95},
    mouth: {y: 120},
    length: 100,
    height: 150
},
{   //阿飞
    eye_left: {x: 25,y: 65},
    eye_right: {x: 75,y: 65},
    nose: {x: 50,y: 100},
    mouth: {y: 130},
    length: 100,
    height: 150
},
{   //曹操
    eye_left: {x: 32,y: 55},
    eye_right: {x: 68,y: 55},
    nose: {x: 50,y: 80},
    mouth: {y: 95},
    length: 100,
    height: 120
},
{   //曹洪
    eye_left: {x: 35,y: 80},
    eye_right: {x: 91,y: 80},
    nose: {x: 63,y: 130},
    mouth: {y: 150},
    length: 126,
    height: 190
},
{   //蒋干
    eye_left: {x: 35,y: 60},
    eye_right: {x: 115,y: 60},
    nose: {x: 75,y: 120},
    mouth: {y: 150},
    length: 150,
    height: 180
},
{   //关羽
    eye_left: {x: 45,y: 80},
    eye_right: {x: 105,y: 80},
    nose: {x: 75,y: 120},
    mouth: {y: 150},
    length: 150,
    height: 180
},
{   //姜尚
    eye_left: {x: 45,y: 80},
    eye_right: {x: 105,y: 80},
    nose: {x: 75,y: 120},
    mouth: {y: 150},
    length: 150,
    height: 180
},
{   //孟良
    eye_left: {x: 45,y: 80},
    eye_right: {x: 105,y: 80},
    nose: {x: 75,y: 120},
    mouth: {y: 160},
    length: 150,
    height: 195
},
{   //夏侯惇
    eye_left: {x: 35,y: 80},
    eye_right: {x: 95,y: 80},
    nose: {x: 65,y: 120},
    mouth: {y: 150},
    length: 130,
    height: 180
},
{   //许褚
    eye_left: {x: 35,y: 80},
    eye_right: {x: 95,y: 80},
    nose: {x: 65,y: 125},
    mouth: {y: 150},
    length: 130,
    height: 190
},
{   //宇文成都
    eye_left: {x: 41,y: 82},
    eye_right: {x: 99,y: 82},
    nose: {x: 70,y: 120},
    mouth: {y: 180},
    length: 140,
    height: 200
},
{   //周德威
    eye_left: {x: 30,y: 82},
    eye_right: {x: 100,y: 82},
    nose: {x: 65,y: 125},
    mouth: {y: 160},
    length: 130,
    height: 190
},
{   //程咬金
    eye_left: {x: 38,y: 84},
    eye_right: {x: 92,y: 84},
    nose: {x: 65,y: 123},
    mouth: {y: 150},
    length: 130,
    height: 180
},
{   //单雄信
    eye_left: {x: 32,y: 85},
    eye_right: {x: 90,y: 85},
    nose: {x: 61,y: 124},
    mouth: {y: 158},
    length: 122,
    height: 180
},
{   //后羿
    eye_left: {x: 36,y: 82},
    eye_right: {x: 98,y: 82},
    nose: {x: 75,y: 125},
    mouth: {y: 170},
    length: 134,
    height: 190
},
{   //黄盖
    eye_left: {x: 45,y: 85},
    eye_right: {x: 105,y: 85},
    nose: {x: 75,y: 125},
    mouth: {y: 150},
    length: 150,
    height: 180
},
{   //黄胖
    eye_left: {x: 38,y: 81},
    eye_right: {x: 96,y: 81},
    nose: {x: 67,y: 118},
    mouth: {y: 148},
    length: 134,
    height: 180
},
{   //姜维
    eye_left: {x: 90,y: 205},
    eye_right: {x: 233,y: 205},
    nose: {x: 161,y: 303},
    mouth: {y: 375},
    length: 323,
    height: 445
},      //记号
{   //焦赞
    eye_left: {x: 48,y: 83},
    eye_right: {x: 102,y: 83},
    nose: {x: 75,y: 122},
    mouth: {y: 147},
    length: 150,
    height: 180
},
{   //荆轲
    eye_left: {x: 47,y: 81},
    eye_right: {x: 103,y: 81},
    nose: {x: 75,y: 120},
    mouth: {y: 146},
    length: 150,
    height: 180
},
{   //雷震子
    eye_left: {x: 47,y: 82},
    eye_right: {x: 103,y: 82},
    nose: {x: 75,y: 127},
    mouth: {y: 150},
    length: 150,
    height: 180
},
{   //廉颇
    eye_left: {x: 47,y: 83},
    eye_right: {x: 103,y: 83},
    nose: {x: 75,y: 123},
    mouth: {y: 148},
    length: 150,
    height: 180
},
{   //吕蒙
    eye_left: {x: 48,y: 84},
    eye_right: {x: 102,y: 84},
    nose: {x: 75,y: 120},
    mouth: {y: 146},
    length: 150,
    height: 180
},
{   //马谡
    eye_left: {x: 90,y: 162},
    eye_right: {x: 210,y: 162},
    nose: {x: 150,y: 247},
    mouth: {y: 295},
    length: 300,
    height: 360
},
{   //司马懿
    eye_left: {x: 102,y: 173},
    eye_right: {x: 198,y: 173},
    nose: {x: 150,y: 250},
    mouth: {y: 295},
    length: 300,
    height: 360
},
{   //孙权
    eye_left: {x: 93,y: 167},
    eye_right: {x: 207,y: 167},
    nose: {x: 150,y: 245},
    mouth: {y: 291},
    length: 300,
    height: 360
},
{   //太史慈
    eye_left: {x: 95,y: 168},
    eye_right: {x: 205,y: 168},
    nose: {x: 150,y: 247},
    mouth: {y: 293},
    length: 300,
    height: 360
},
{   //尉迟恭
    eye_left: {x: 94,y: 165},
    eye_right: {x: 206,y: 165},
    nose: {x: 150,y: 247},
    mouth: {y: 293},
    length: 300,
    height: 360
},
{   //徐晃
    eye_left: {x: 95,y: 168},
    eye_right: {x: 205,y: 168},
    nose: {x: 150,y: 247},
    mouth: {y: 293},
    length: 300,
    height: 360
},
{   //杨延德
    eye_left: {x: 97,y: 164},
    eye_right: {x: 203,y: 164},
    nose: {x: 150,y: 238},
    mouth: {y: 292},
    length: 300,
    height: 360
},
{   //杨延嗣
    eye_left: {x: 93,y: 166},
    eye_right: {x: 207,y: 166},
    nose: {x: 150,y: 248},
    mouth: {y: 293},
    length: 300,
    height: 360
},
{   //张飞
    eye_left: {x: 91,y: 169},
    eye_right: {x: 209,y: 169},
    nose: {x: 150,y: 252},
    mouth: {y: 295},
    length: 300,
    height: 360
},
{   //赵高
    eye_left: {x: 92,y: 167},
    eye_right: {x: 208,y: 167},
    nose: {x: 150,y: 248},
    mouth: {y: 303},
    length: 300,
    height: 360
},
{   //赵匡胤
    eye_left: {x: 92,y: 166},
    eye_right: {x: 208,y: 166},
    nose: {x: 150,y: 246},
    mouth: {y: 296},
    length: 300,
    height: 360
},
{   //钟离春
    eye_left: {x: 92,y: 162},
    eye_right: {x: 208,y: 162},
    nose: {x: 150,y: 248},
    mouth: {y: 305},
    length: 300,
    height: 360
},
{   //专诸
    eye_left: {x: 90,y: 164},
    eye_right: {x: 210,y: 164},
    nose: {x: 150,y: 245},
    mouth: {y: 298},
    length: 300,
    height: 360
}];
// error messages
var messages = {
    URL_ERROR: 'Invalid URL',
    LOAD_ERROR: 'Failed to Load',
    LOADING: 'Loading...',
    NO_FACE: 'No face detected',
    NO_CAMERA: 'No camera available'
};
//人脸识别API信息//////////////////////////////////////////////////////
var API_URL = 'http://api.cn.faceplusplus.com/v2/';
var API_KEY = 'd5e369fa35d0bd86d033afd171e2e08a';
var API_SECRET = 'SBouWCQsrQTGITBDgCa0slvr_ak1a61K';
var isMobile = {
    Android: function() {
        return navigator.userAgent.match(/Android/i) ? true: false;
    },
    BlackBerry: function() {
        return navigator.userAgent.match(/BlackBerry/i) ? true: false;
    },
    iOS: function() {
        return navigator.userAgent.match(/iPhone|iPad|iPod/i) ? true: false;
    },
    Windows: function() {
        return navigator.userAgent.match(/IEMobile/i) ? true: false;
    },
    any: function() {
        return (isMobile.Android() || isMobile.BlackBerry() || isMobile.iOS() || isMobile.Windows());
    }
};
Parse.initialize("ig1NBdqNPrI9zmas8Sx3DatRThGuiHuWNxhowhdf", "wOITAeT2FWHjjKmO8KqzF4eFJqAi6cAO4PneUvSC");
var faceRecord = Parse.Object.extend("face");
var query = new Parse.Query(faceRecord);

var container = document.querySelector('.gallery');
var msnry = new Masonry(container);
var myScroll;
var scrollMoved = false;
var win_width = $(window).width();
var win_height = $(window).height();

//配置信息
var SERVER_URL = "http://soongboyu.eicp.net";
var mediaLoaded = false;
var musicOn = true;
var RANDOM = 0;
var ORDER = 1;
var playmode = RANDOM;
var choosedFacebookInfo;
var choosedFBCount = 0;

var choosedFacebook = [];

//读取脸谱图片
var imgs = [];

var myfilename;

///////////////////////////////////////////////////////////////////////
var cl = new CanvasLoader('canvasloader-container');
cl.setColor('#0e4d38'); // default is '#000000'
cl.setShape('rect'); // default is 'oval'
cl.setDiameter(62); // default is 40
cl.setDensity(24); // default is 40
cl.setRange(1); // default is 1.3
cl.setFPS(14); // default is 24
/////////////////////////////////////////////////////////////////////
var cl1 = new CanvasLoader('canvasloader-container1');
cl1.setColor('#0e4d38'); // default is '#000000'
cl1.setShape('rect'); // default is 'oval'
cl1.setDiameter(62); // default is 40
cl1.setDensity(24); // default is 40
cl1.setRange(1); // default is 1.3
cl1.setFPS(14); // default is 24
/////////////////////////////////////////////////////////////////////
var cl2 = new CanvasLoader('canvasloader-container2');
cl2.setColor('#0e4d38'); // default is '#000000'
cl2.setShape('rect'); // default is 'oval'
cl2.setDiameter(62); // default is 40
cl2.setDensity(24); // default is 40
cl2.setRange(1); // default is 1.3
cl2.setFPS(14); // default is 24

/////////////////////////////////////////////////////////////////////
var cl3 = new CanvasLoader('canvasloader-container3');
cl3.setColor('#0e4d38'); // default is '#000000'
cl3.setShape('rect'); // default is 'oval'
cl3.setDiameter(62); // default is 40
cl3.setDensity(24); // default is 40
cl3.setRange(1); // default is 1.3
cl3.setFPS(14); // default is 24
// var loaderObj = document.getElementById("canvasLoader");
// loaderObj.style.position = "absolute";
// loaderObj.style["top"] = cl.getDiameter() * -0.5 + "px";
// loaderObj.style["left"] = cl.getDiameter() * -0.5 + "px";